In [1]:
import pandas as pd

In [2]:
data = [['A', 'Math'], ['B', 'English'], ['C', 'Math'], ['D', 'Biology'], ['E', 'Math'], ['F', 'Computer'], ['G', 'Math'], ['H', 'Math'], ['I', 'Math']]
courses = pd.DataFrame(data, columns=['student', 'class']).astype({'student':'object', 'class':'object'})

In [3]:
courses

  student     class
0       A      Math
1       B   English
2       C      Math
3       D   Biology
4       E      Math
5       F  Computer
6       G      Math
7       H      Math
8       I      Math

Write a solution to find all the classes that have at least five students.

Return the result table in any order.

The result format is in the following example.

| class   |
|---------|
| Math    |

In [4]:
aggregated_courses=courses.groupby("class")["student"].count().reset_index(name="cnt")
aggregated_courses

      class  cnt
0   Biology    1
1  Computer    1
2   English    1
3      Math    6

In [6]:
aggregated_courses.loc[(aggregated_courses["cnt"] >= 5)] \
    .drop(labels=["cnt"], axis = 1)

  class
3  Math